export const text = `
섹션 1. 시작하며

4개 ∙ (10분)

강의 소개

10:46

수강생 커뮤니티 참가 안내

예제 코드 및 강의 자료 안내

질의 응답 관련 공지사항


섹션 2. Next.js를 소개합니다

4개 ∙ (47분)

1.1) Next.js를 소개합니다

07:53

1.2) Next.js 사전렌더링 이해하기

17:01

1.3) 실습용 백엔드 서버 세팅하기

18:44

1.4) 본격적인 학습에 앞서

04:18


섹션 3. Page Router 핵심 정리

21개 ∙ (5시간 20분)

2.1) Page Router를 소개합니다

21:22

2.2) 페이지 라우팅 설정하기

20:34

2.3) 네비게이팅

07:12

2.4) 프리페칭

14:35

2.5) API Routes

06:13

2.6) 스타일링

09:16

2.7) 글로벌 레이아웃 설정하기

14:16

2.8) 페이지별 레이아웃 설정하기

26:14

2.9) 한입북스 UI 구현하기

33:32

2.10) 사전 렌더링과 데이터페칭

10:14

2.11) SSR 1. 소개 및 실습

12:40

2.12) SSR 2. 실습

27:15

2.13) SSG 1. 소개

06:14

2.14) SSG 2. 정적 경로에 적용하기

19:18

2.15) SSG 3. 동적 경로에 적용하기

11:26

2.16) SSG 4. 폴백옵션 설정하기

17:28

2.17) ISR 1. 소개 및 실습

07:49

2.18) ISR 2. 주문형 재 검증

10:26

2.19) SEO 설정하기

15:06

2.20) 배포하기

12:18

2.21) 페이지 라우터 정리

16:43


섹션 4. App Router 시작하기

8개 ∙ (2시간 5분)

3.1) App Router 시작하기

07:35

↳ Next.js 15.0.3 버전부터 주의하셔야 할 점

3.2) 페이지 라우팅 설정하기

16:19

3.3) 레이아웃 설정하기

17:35

3.4) 리액트 서버 컴포넌트 이해하기

23:04

3.5) 리액트 서버 컴포넌트 주의사항

20:42

3.6) 네비게이팅

22:43

3.7) 한입북스 UI 구현하기

18:00


섹션 5. 데이터 페칭

3개 ∙ (58분)

4.1) 앱 라우터의 데이터 페칭

28:23

4.2) 데이터 캐시

17:07

4.3) 리퀘스트 메모이제이션

13:24


섹션 6. 페이지 캐싱

5개 ∙ (1시간 12분)

5.1) 풀 라우트 캐시 1

16:36

5.2) 풀 라우트 캐시 2

16:23

5.3) 풀 라우트 캐시 3. 동적 경로에 적용하기

15:23

5.4) 라우트 세그먼트 옵션

14:09

5.5) 클라이언트 라우터 캐시

10:07


섹션 7. 스트리밍과 에러핸들링

5개 ∙ (1시간 14분)

6.1) 스트리밍이란?

08:18

6.2) 스트리밍 1. 페이지 스트리밍 적용하기

13:17

6.3) 스트리밍 2. 컴포넌트 스트리밍 적용하기

12:54

6.4) 스켈레톤 UI 적용하기

15:22

6.5) 에러 핸들링 (error.tsx)

24:49


섹션 8. 서버 액션

7개 ∙ (1시간 53분)

7.1) 서버 액션을 소개합니다

20:36

7.2) 리뷰 추가 기능 구현하기

18:42

7.3) 리뷰 조회 기능 구현하기

19:41

7.4) 리뷰 재검증 구현하기

14:17

7.5) 다양한 재검증 방식 살펴보기

09:22

7.6) 클라이언트 컴포넌트에서의 서버액션

13:41

7.7) 리뷰 삭제 기능 구현하기

17:03


섹션 9. 고급 라우팅 패턴

3개 ∙ (51분)

8.1) 패럴렐 라우트

21:51

8.2) 인터셉팅 라우트

22:22

8.3) 패럴랠 & 인터셉팅 라우트

06:52


섹션 10. 최적화와 배포

5개 ∙ (58분)

9.1) 이미지 최적화

15:45

9.2) 검색 엔진 최적화 (SEO)

16:35

9.3) 배포하기

12:06

9.4) 배포 후 최적화

11:23

9.5) 마치면서

02:37"

`;
